#4. Робота світлофора для водіїв запрограмована таким чином: на початку кожної
#години протягом трьох хвилин горить зелений сигнал, потім протягом однієї хвилини -
#жовтий, протягом двох хвилин - червоний, протягом трьох хвилин - знову зелений і т. д.
#Розробити програму, яка вводить дійсне число t, що означає час в хвилинах, що
#минув з початку чергової години і визначає сигнал якого кольору горить для водіїв в цей
#момент.
while True:
    while True:
        try :
            t = int(input())
            break
        except ValueError:
            print('Введіть число')
    p = t % 6
    if(p <= 3):
        print('Зелений')
    elif(p > 3 and p <= 4):
        print('Жовтий')
    elif(p <= 6):
        print('Червоний')
    answ = input('Бажаєте продовжити ? Y/N: ')
    if (answ == 'Y' or answ == 'y'):
        continue
    else:
        break

