'''
Сформувати функцію для обчислення цифрового кореню натурального числа.
Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
числа.
Виконав : Канюка Р. 122В
'''
from memory_profiler import memory_usage
from datetime import datetime
import numpy as np
import random
while True:
    #Ініціалізація n і знаходження довжини.
    while True:
        try:
            n = input("Введіть число для знаходження цифрового кореня : ")
            beg = int(n)
            break
        except ValueError :
            print('Введіть число!')
    #Реалізація алгоритму
    start = datetime.now()
    while(len(n) > 1):
        summ = 0
        for i in range(len(n)):
            summ += int(n[i])
        n = str(summ)
    print("Кількість використаних МБ :",memory_usage())
    print("Затрачений час :",datetime.now() - start)
    print("цифровий корінь ", beg , "=", summ)
    quest = input('Завершити програму? Y/N : ')
    if(quest == 'Y' or quest == 'y'):
        break
"""
Час розробки : 5 - 7 хв
Реалізуються доволі просто ,проте читабельність коду не висока ,
використовує менший обсяг пам'яті.
"""
